app/controllers/archives_controller.rb

	def index
		@articles_by_month = Article.all.group_by { |article| article.created_at.strftime("%B") }
---
SELECT "articles".* FROM "articles"