app/controllers/articles_controller.rb

	def show
		@article = Article.find(params[:id])
		@article.increment
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "view_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["view_count", 1], ["updated_at", "2018-02-14 15:14:39.758732"], ["id", 9]]

	def create
		@article = Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "First Article"], ["body", "This is the first article on this blog. Hello!"], ["created_at", "2018-02-15 12:52:35.174249"], ["updated_at", "2018-02-15 12:52:35.174249"]]

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "10-dithering-opt.jpg"], ["image_updated_at", "2018-02-14 11:21:50.233046"], ["updated_at", "2018-02-14 11:21:50.732497"], ["id", 9]]

	def feed
  	@title = "RSS Feed"

  	@articles = Article.order("updated_at desc")

  	# this will be our Feed's update timestamp
  	@updated = @articles.first.updated_at unless @articles.empty?
---
SELECT  "articles".* FROM "articles" ORDER BY updated_at desc LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "articles" LIMIT ?  [["LIMIT", 1]]