app/controllers/popular_articles_controller.rb

	def index
		@popular_articles = Article.order('articles.view_count DESC').limit(3)
---
SELECT  "articles".* FROM "articles" ORDER BY articles.view_count DESC LIMIT ?  [["LIMIT", 3]]